u-blox/cellular/port/platform/stm/stm32f4/src/cellular_port_uart.c
// Table of the constant data per UART.
static const CellularPortUartConstData_t gUartCfg[] = {{}, // This to avoid having to -1 all the time
                                                       {USART1,
                                                        CELLULAR_CFG_UART1_DMA_ENGINE,
                                                        CELLULAR_CFG_UART1_DMA_STREAM,
                                                        CELLULAR_CFG_UART1_DMA_CHANNEL,
                                                        USART1_IRQn},
                                                       {USART2,
                                                        CELLULAR_CFG_UART2_DMA_ENGINE,
                                                        CELLULAR_CFG_UART2_DMA_STREAM,
                                                        CELLULAR_CFG_UART2_DMA_CHANNEL,
                                                        USART2_IRQn},
                                                       {USART3,
                                                        CELLULAR_CFG_UART3_DMA_ENGINE,
                                                        CELLULAR_CFG_UART3_DMA_STREAM,
                                                        CELLULAR_CFG_UART3_DMA_CHANNEL,
                                                        USART3_IRQn},
                                                       {UART4,
                                                        CELLULAR_CFG_UART4_DMA_ENGINE,
                                                        CELLULAR_CFG_UART4_DMA_STREAM,
                                                        CELLULAR_CFG_UART4_DMA_CHANNEL,
                                                        UART4_IRQn},
                                                       {UART5,
                                                        CELLULAR_CFG_UART5_DMA_ENGINE,
                                                        CELLULAR_CFG_UART5_DMA_STREAM,
                                                        CELLULAR_CFG_UART5_DMA_CHANNEL,
                                                        UART5_IRQn},
                                                       {USART6,
                                                        CELLULAR_CFG_UART6_DMA_ENGINE,
                                                        CELLULAR_CFG_UART6_DMA_STREAM,
                                                        CELLULAR_CFG_UART6_DMA_CHANNEL,
                                                        USART6_IRQn},
                                                       {UART7,
                                                        CELLULAR_CFG_UART7_DMA_ENGINE,
                                                        CELLULAR_CFG_UART7_DMA_STREAM,
                                                        CELLULAR_CFG_UART7_DMA_CHANNEL,
                                                        UART7_IRQn},
                                                       {UART8,
                                                        CELLULAR_CFG_UART8_DMA_ENGINE,
                                                        CELLULAR_CFG_UART8_DMA_STREAM,
                                                        CELLULAR_CFG_UART8_DMA_CHANNEL,
                                                        UART8_IRQn}};

// Table to make it possible for UART interrupts to get to the UART data
// without having to trawl through a list.
static CellularPortUartData_t *gpUart[CELLULAR_PORT_MAX_NUM_UARTS + 1] = {NULL};

// Table to make it possible for a DMA interrupt to
// get to the UART data.  +1 is for the usual reason
static CellularPortUartData_t *gpDmaUart[(CELLULAR_PORT_MAX_NUM_DMA_ENGINES + 1) *
                                          CELLULAR_PORT_MAX_NUM_DMA_ENGINES] = {NULL};

/* ----------------------------------------------------------------
 * STATIC FUNCTIONS
 * -------------------------------------------------------------- */

// Add a UART data structure to the list.
// The required memory is malloc()ed.
CellularPortUartData_t *pAddUart(int32_t uart,
                                 CellularPortUartData_t *pUartData)
{
    CellularPortUartData_t **ppUartData = &gpUartDataHead;

    // Go to the end of the list
    while (*ppUartData != NULL) {
        ppUartData = &((*ppUartData)->pNext);
    }

    // Malloc memory for the item
    *ppUartData = (CellularPortUartData_t *) pCellularPort_malloc(sizeof(CellularPortUartData_t));
    if (*ppUartData != NULL) {
        // Copy the data in
        pCellularPort_memcpy(*ppUartData, pUartData, sizeof(CellularPortUartData_t));
        (*ppUartData)->pNext = NULL;
        // Set the UART table up to point to it
        // so that the UART interrupt can find it
        gpUart[uart] = *ppUartData;
        // And set the other table up so that the
        // DMA interrupt can find the UART data as well
        gpDmaUart[pUartData->pConstData->dmaEngine +
                  pUartData->pConstData->dmaStream] = *ppUartData;
    }

    return *ppUartData;
}

// Find the UART data structure for a given UART.
CellularPortUartData_t *pGetUart(int32_t uart)
{
    CellularPortUartData_t *pUartData = gpUartDataHead;
    bool found = false;

    while (!found && (pUartData != NULL)) {
        if (pUartData->number == uart) {
            found = true;
        } else {
            pUartData = pUartData->pNext;
        }
    }

    return pUartData;
}

// Remove a UART from the list.
// The memory occupied is free()ed.
bool removeUart(int32_t uart)
{
    CellularPortUartData_t **ppUartData = &gpUartDataHead;
    CellularPortUartData_t *pTmp = NULL;
    bool found = false;

    // Find it in the list
    while (!found && (*ppUartData != NULL)) {
        if ((*ppUartData)->number == uart) {
            found = true;
        } else {
            pTmp = *ppUartData;
            ppUartData = &((*ppUartData)->pNext);
        }
    }

    // Remove the item
    if (*ppUartData != NULL) {
        // Move the next pointer of the previous
        // entry on
        if (pTmp != NULL) {
            pTmp->pNext = (*ppUartData)->pNext;
        }
        // NULL the entries in the two tables
        gpUart[uart] = NULL;
        gpDmaUart[(*ppUartData)->pConstData->dmaEngine +
                  (*ppUartData)->pConstData->dmaStream] = NULL;
        // Free memory and NULL the pointer
        cellularPort_free(*ppUartData);
        *ppUartData = NULL;
    }

    return found;
}

/* ----------------------------------------------------------------
 * PUBLIC FUNCTIONS: INTERRUPT HANDLERS
 * -------------------------------------------------------------- */

