u-blox/cellular/port/platform/stm/stm32f4/src/cellular_port_uart.c
                            // Attach the DMA to the UART at one end
                            LL_DMA_SetPeriphAddress(gpDmaReg[gUartCfg[uart].dmaEngine],
                                                    gUartCfg[uart].dmaStream,
                                                    (uint32_t) (gUartCfg[uart].pReg->DR));

                            // ...and to the RAM buffer at the other end
                            LL_DMA_SetMemoryAddress(gpDmaReg[gUartCfg[uart].dmaEngine],
                                                    gUartCfg[uart].dmaStream,
                                                    (uint32_t) (uartData.pRxBufferStart));
                            LL_DMA_SetDataLength(gpDmaReg[gUartCfg[uart].dmaEngine],
                                                 gUartCfg[uart].dmaStream,
                                                 CELLULAR_PORT_UART_RX_BUFFER_SIZE);

                            // Set DMA priority
                            NVIC_SetPriority(gpDmaStreamIrq[gUartCfg[uart].dmaEngine][gUartCfg[uart].dmaStream],
                                             NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 5, 0));

                            // Clear all the DMA flags and the DMA pending IRQ from any previous
                            // session first, or an unexpected interrupt may result
                            gpLlDmaClearFlagHt[gUartCfg[uart].dmaStream](gpDmaReg[gUartCfg[uart].dmaEngine]);
                            gpLlDmaClearFlagTc[gUartCfg[uart].dmaStream](gpDmaReg[gUartCfg[uart].dmaEngine]);
                            gpLlDmaClearFlagTe[gUartCfg[uart].dmaStream](gpDmaReg[gUartCfg[uart].dmaEngine]);
                            gpLlDmaClearFlagDme[gUartCfg[uart].dmaStream](gpDmaReg[gUartCfg[uart].dmaEngine]);
                            gpLlDmaClearFlagFe[gUartCfg[uart].dmaStream](gpDmaReg[gUartCfg[uart].dmaEngine]);
                            NVIC_ClearPendingIRQ(gpDmaStreamIrq[gUartCfg[uart].dmaEngine][gUartCfg[uart].dmaStream]);

                            // Enable half full and transmit complete interrupts
                            LL_DMA_EnableIT_HT(gpDmaReg[gUartCfg[uart].dmaEngine],
                                               gUartCfg[uart].dmaStream);
                            LL_DMA_EnableIT_TC(gpDmaReg[gUartCfg[uart].dmaEngine],
                                               gUartCfg[uart].dmaStream);

                            // Go!
                            NVIC_EnableIRQ(gpDmaStreamIrq[gUartCfg[uart].dmaEngine][gUartCfg[uart].dmaStream]);

                            // Initialise the USART
                            usartInitStruct.BaudRate = baudRate;
                            usartInitStruct.DataWidth = LL_USART_DATAWIDTH_8B;
                            usartInitStruct.StopBits = LL_USART_STOPBITS_1;
                            usartInitStruct.Parity = LL_USART_PARITY_NONE;
                            usartInitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
                            // TODO: need to connect flow control to DMA?
                            usartInitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
                            if ((pinRts >= 0) && (pinCts >= 0)) {
                                usartInitStruct.HardwareFlowControl = LL_USART_HWCONTROL_RTS_CTS;
                            } else {
                                if (pinRts >= 0) {
                                    usartInitStruct.HardwareFlowControl = LL_USART_HWCONTROL_RTS;
                                } else {
                                    usartInitStruct.HardwareFlowControl = LL_USART_HWCONTROL_CTS;
                                }
                            }
                            usartInitStruct.OverSampling = LL_USART_OVERSAMPLING_16;
                            platformError = LL_USART_Init(gUartCfg[uart].pReg, &usartInitStruct);
                        }

                        // STILL more stuff to configure...
                        if (platformError == SUCCESS) {
                            LL_USART_ConfigAsyncMode(gUartCfg[uart].pReg);
                            LL_USART_EnableDMAReq_RX(gUartCfg[uart].pReg);
                            LL_USART_EnableIT_IDLE(gUartCfg[uart].pReg);

                            // Enable USART interrupt
                            NVIC_SetPriority(gUartCfg[uart].irq,
                                             NVIC_EncodePriority(NVIC_GetPriorityGrouping(),
                                                                 5, 1));
                            NVIC_ClearPendingIRQ(gUartCfg[uart].irq);
                            NVIC_EnableIRQ(gUartCfg[uart].irq);

                            // Enable USART and DMA
                            LL_DMA_EnableStream(gpDmaReg[gUartCfg[uart].dmaEngine],
                                                gUartCfg[uart].dmaStream);
                            LL_USART_Enable(gUartCfg[uart].pReg);
                        }

                        // Finally, add the UART to the list
                        if (platformError == SUCCESS) {
                            errorCode = CELLULAR_PORT_OUT_OF_MEMORY;
                            if (pAddUart(uart, &uartData) != NULL) {
                                errorCode = CELLULAR_PORT_SUCCESS;
                            }
                        }
                    }
                }

                CELLULAR_PORT_MUTEX_UNLOCK(uartData.mutex);

                // If we failed, clean up
                if (errorCode != 0) {
                    cellularPortMutexDelete(uartData.mutex);
                    cellularPort_free(uartData.pRxBufferStart);
                }
            }
        }
    }

    return (int32_t) errorCode;
}

// Shutdown a UART.
int32_t cellularPortUartDeinit(int32_t uart)
{
    CellularPortErrorCode_t errorCode = CELLULAR_PORT_INVALID_PARAMETER;
    CellularPortUartData_t *pUartData;

    if ((uart > 0) && (uart <= CELLULAR_PORT_MAX_NUM_UARTS)) {
        pUartData = pGetUart(uart);
        errorCode = CELLULAR_PORT_SUCCESS;
        if (pUartData != NULL) {

            errorCode = CELLULAR_PORT_PLATFORM_ERROR;
            // No need to lock the mutex, we need to delete it
            // and we're not allowed to delete a locked mutex.
            // The caller needs to make sure that no read/write
            // is in progress when this function is called.

